Revit 2027 API
PrintParameters.PageOrientation Property
 The Page Orientation of the Print Setting.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PageOrientationType PageOrientation { get; set; }
Public Property PageOrientation As PageOrientationType
	Get
	Set
public:
property PageOrientationType PageOrientation {
	PageOrientationType get ();
	void set (PageOrientationType value);
}
member PageOrientation : PageOrientationType with get, set
Property Value
PageOrientationType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the input argument is out of range.
See Also
Reference
PrintParameters Class
Autodesk.Revit.DB Namespace